In [51]:
import pandas as pd


# Создадим набор данных в виде словаря
data = {
    'Имя': ['Анна', 'Борис', 'Виктория', 'Дмитрий', 'Екатерина'],
    'Возраст': [21, 24, 20, 22, 23],
    'Пол': ['Ж', 'М', 'Ж', 'М', 'Ж'],
    'Оценка_математика': [85, 70, 92, 65, 78],
    'Оценка_физика': [70, 82, 88, 75, 60]
}

In [52]:
# Создаем оъект DataFrame из словаря
df = pd.DataFrame(data)

In [53]:
df

         Имя  Возраст Пол  Оценка_математика  Оценка_физика
0       Анна       21   Ж                 85             70
1      Борис       24   М                 70             82
2   Виктория       20   Ж                 92             88
3    Дмитрий       22   М                 65             75
4  Екатерина       23   Ж                 78             60

In [54]:
df.head(3)

        Имя  Возраст Пол  Оценка_математика  Оценка_физика
0      Анна       21   Ж                 85             70
1     Борис       24   М                 70             82
2  Виктория       20   Ж                 92             88

In [55]:
selected_columns = df[["Имя", "Оценка_математика"]]
selected_columns

         Имя  Оценка_математика
0       Анна                 85
1      Борис                 70
2   Виктория                 92
3    Дмитрий                 65
4  Екатерина                 78

In [56]:
filtered_data = df[df["Возраст"] > 22]
filtered_data

         Имя  Возраст Пол  Оценка_математика  Оценка_физика
1      Борис       24   М                 70             82
4  Екатерина       23   Ж                 78             60

In [57]:
grouped_by_sex = df.groupby("Пол")[['Оценка_математика', "Оценка_физика"]].mean()
grouped_by_sex["Оценка_физика"] = round(grouped_by_sex["Оценка_физика"], 1)
grouped_by_sex

     Оценка_математика  Оценка_физика
Пол
Ж                 85.0           72.7
М                 67.5           78.5

In [58]:
grouped_by_sex = df.groupby("Пол")[['Оценка_математика', "Оценка_физика"]].mean().round()
grouped_by_sex

     Оценка_математика  Оценка_физика
Пол
Ж                 85.0           73.0
М                 68.0           78.0

In [59]:
sorted_df = df.sort_values(["Оценка_физика", "Оценка_математика"], ascending=False)
sorted_df

         Имя  Возраст Пол  Оценка_математика  Оценка_физика
2   Виктория       20   Ж                 92             88
1      Борис       24   М                 70             82
3    Дмитрий       22   М                 65             75
0       Анна       21   Ж                 85             70
4  Екатерина       23   Ж                 78             60

In [60]:
df["Средняя_оценка"] = None
df

         Имя  Возраст Пол  Оценка_математика  Оценка_физика Средняя_оценка
0       Анна       21   Ж                 85             70           None
1      Борис       24   М                 70             82           None
2   Виктория       20   Ж                 92             88           None
3    Дмитрий       22   М                 65             75           None
4  Екатерина       23   Ж                 78             60           None

In [62]:
df.Средняя_оценка = (df.Оценка_математика + df.Оценка_физика) / 2
df

         Имя  Возраст Пол  Оценка_математика  Оценка_физика  Средняя_оценка
0       Анна       21   Ж                 85             70            77.5
1      Борис       24   М                 70             82            76.0
2   Виктория       20   Ж                 92             88            90.0
3    Дмитрий       22   М                 65             75            70.0
4  Екатерина       23   Ж                 78             60            69.0

In [65]:
df["Средняя_оценка"] = df[["Оценка_физика", "Оценка_математика"]].mean(axis=1)
df

         Имя  Возраст Пол  Оценка_математика  Оценка_физика  Средняя_оценка
0       Анна       21   Ж                 85             70            77.5
1      Борис       24   М                 70             82            76.0
2   Виктория       20   Ж                 92             88            90.0
3    Дмитрий       22   М                 65             75            70.0
4  Екатерина       23   Ж                 78             60            69.0

In [66]:
# Применим фукцию
def double_grade(grade):
    return grade * 2


df["Оценка_математика"] = df["Оценка_математика"].apply(double_grade)
df

         Имя  Возраст Пол  Оценка_математика  Оценка_физика  Средняя_оценка
0       Анна       21   Ж                170             70            77.5
1      Борис       24   М                140             82            76.0
2   Виктория       20   Ж                184             88            90.0
3    Дмитрий       22   М                130             75            70.0
4  Екатерина       23   Ж                156             60            69.0

In [67]:
df["Оценка_русский"] = [70, 85, None, 50, 99]
df

,Имя,Возраст,Пол,Оценка_математика,Оценка_физика,Средняя_оценка,Оценка_русский
0,Анна,21,Ж,170,70,77.5,70.0
1,Борис,24,М,140,82,76.0,85.0
2,Виктория,20,Ж,184,88,90.0,NaN
3,Дмитрий,22,М,130,75,70.0,50.0
4,Екатерина,23,Ж,156,60,69.0,99.0

In [68]:
df.dropna()
df

,Имя,Возраст,Пол,Оценка_математика,Оценка_физика,Средняя_оценка,Оценка_русский
0,Анна,21,Ж,170,70,77.5,70.0
1,Борис,24,М,140,82,76.0,85.0
2,Виктория,20,Ж,184,88,90.0,NaN
3,Дмитрий,22,М,130,75,70.0,50.0
4,Екатерина,23,Ж,156,60,69.0,99.0

In [69]:
df.dropna(inplace=True)
df

,Имя,Возраст,Пол,Оценка_математика,Оценка_физика,Средняя_оценка,Оценка_русский
0,Анна,21,Ж,170,70,77.5,70.0
1,Борис,24,М,140,82,76.0,85.0
3,Дмитрий,22,М,130,75,70.0,50.0
4,Екатерина,23,Ж,156,60,69.0,99.0